
var updatesData = [
    {
        version: "1.4.1",
        date: "2024.05.?",
        changes: [
            "现在主界面有了看板娘背景。",
            "调整了一些视觉效果以适配看板娘背景。",
            "全屏功能已解禁，现在主界面窗口允许随意拉伸和全屏了。",
            "小窗口的关闭按钮现在按下时颜色会变色（macOS）。",
            "修复了弹幕会被ass字幕挡住的bug。",
            "现在黑色弹幕的描边是白色了。",
            "修复了linux版播放视频时左上角出现 投屏 按钮的bug。",
        ]
    },
    {
        version: "1.4.0",
        date: "2024.05.27",
        changes: [
            "修复了展示带滚动条的内容时最底部显示不全的问题。",
            "每个发行版现在只会保留对应的ffmpeg，大幅减小了包体。",
            "macOS移除了所有窗口的默认窗口栏，大多数更换成了沉浸式的，windows和linux也在这些窗口里拥有了专属的沉浸式关闭按钮。",
            "现在对视频音量的调整会永久生效了，不会再重新打开播放器以后恢复100%音量了。",
            "windows和linux的主界面和播放器界面是无边框的了。",
            "弹出式的小窗口现在会阻止下方互动了。",
            "优化了网络媒体库读取。",
            "新增了windows on arm版本。",
            "优化了各种地方的加载显示。",
            "修复了 macOS版本 当程序不处于最前方或者程序被最小化以后，command+Q快捷键依旧会杀死程序的bug，现在只会在程序处于最前台时快捷键生效。",
        ]
    },
    {
        version: "1.3.0",
        date: "2024.05.24",
        changes: [
            "macOS左上角菜单里新增了 播放网络媒体库 的快捷入口。",
            "修改了 加载中 窗口的界面和文本显示，修改了各种地方的文本描述。",
            "选择字幕的窗口从系统级窗口改成了软件操作级窗口。",
            "新增了linux发行版。",
            "windows的其他窗口也移除了左上角菜单。",
            "优化了选择字幕时的选项显示。",
        ]
    },
    {
        version: "1.2.0",
        date: "2024.05.21",
        changes: [
            "优化了一些功能的处理方式。",
            "将文件生成的保存位置从下载文件夹迁移到了应用程序文件夹。",
            "现在每次启动程序之前会清理掉上一次运行的缓存文件了。",
            "现在播放网络媒体库也会自己进行扫描进行弹幕匹配了。",
            "现在播放网络媒体库也会尝试加载内嵌字幕了（待验证）。",
        ]
    },
    {
        version: "1.1.0",
        date: "2024.05.19",
        changes: [
            "媒体库 界面新增了 播放网络媒体库 按钮，可以播放url链接内的视频。",
        ]
    },
    {
        version: "1.0.1",
        date: "2024.05.14",
        changes: [
            "修复了主界面滚动条在windows显示异常的问题（多了一条滚动条），并且取消了滚动的白色底边距。",
            "修复了番剧详情页面导致页面标题出现错位的bug。",
        ]
    },
    {
        version: "1.0.0",
        date: "2024.05.14",
        changes: [
            "新番更新 板块已完成，现在开放使用。新番更新界面可以查看当天更新的新番有什么，点进去可以查看详情（数据来自弹弹play）。",
            "减淡了整体字体色调。",
            "Windows设备现在不会有顶部菜单栏了（待验证）。",
        ]
    },
    {
        version: "0.8.0",
        date: "2024.05.13",
        changes: [
            "修复了非steam运行时启动程序导致的无法显示字幕问题。",
            "优化了srt字幕的显示，现在描边更粗了。",
            "更多细微调整。",
        ]
    },
    {
        version: "0.7.0",
        date: "2024.05.12",
        changes: [
            "修复了 媒体库 内多次访问不同文件夹内容导致文件夹内部视频堆积混淆的问题。",
            "修复了全屏播放加载ass字幕的视频时，视频下部被黑边吞掉的问题。",
            "更多细微调整。",
            "更多细微修复。"
        ]
    },
    {
        version: "0.6.0",
        date: "2024.05.11",
        changes: [
            "媒体库 功能开放使用，支持导入文件夹，程序会自动列出文件夹内包含的所有视频文件来列表播放。",
            "对接了steam，支持在看番的时候在好友列表显示了（仅通过steam下载的版本）。",
            "修复了一些弹幕有关的显示问题。",
            "更换了新的软件图标。"
        ]
    },
    {
        version: "0.5.0",
        date: "2024.05.02",
        changes: [
            "修复了带有内嵌ass字幕的mkv视频在播放时字幕显示问题了。",
            "修复了手动搜索的剧集播放时只显示章节标题而剧集名字显示undefined的问题了。",
            "现在剧集可以精准匹配了，绝大部分动画可以不用经过选择自动识别出来。",
            "现在鼠标双击可以切换全屏/窗口化了。",
            "各种我做了但是忘了的修复和调整。"
        ]
    },
    {
        version: "0.4.0",
        date: "2024.05.01",
        changes: [
            "加载视频时支持了搜索功能，如果想看的番在预览里没有提供，可以通过手动搜索检索装载弹幕。",
            "给菜单增加了图标。"
        ]
    },
    {
        version: "0.3.0",
        date: "2024.04.30",
        changes: [
            "支持方向键前进后退调节音量了。",
            "已经装载过字幕的视频现在会自动装载字幕。",
            "现在顶部弹幕能正常显示出来了。",
            "现在带内嵌字幕的视频打开之前会询问使用什么字幕格式了。"
        ]
    },
    {
        version: "0.2.0",
        date: "2024.04.30",
        changes: [
            "现在可以装载 vtt ass ssa格式字幕了。",
            "现在macOS版有毛玻璃效果了。",
            "将弹幕文件保存位置迁移到了下载文件夹。",
            "现在 选择弹幕库 的窗口也会跟随系统主题了。",
            "移除了 深色浅色模式 开关，现在更换软件主题会自动跟随系统切换。",
            "优化了弹幕菜单的界面，现在调整弹幕不透明度会记忆位置了。",
            "更多细微调整和bug修复。"
        ]
    },
    {
        version: "0.1.0",
        date: "2024.04.13",
        changes: [
            "弹幕功能已经实装,记得联网。"
        ]
    },
    {
        version: "0.0.7",
        date: "2024.04.12",
        changes: [
            "增加了弹幕功能(暂时没有开放使用)。",
            "现在打开视频会识别是什么动画了。"
        ]
    },
    {
        version: "0.0.6",
        date: "2024.04.07",
        changes: [
            "添加了还没做实际功能的右边菜单，悬浮可出现显示。",
            "现在任务栏图标右键可以快捷进入最近播放的视频（前提是在使用这个功能之前先播放过视频）。",
            "现在播放器会自动记录上次视频的观看位置并自动从该位置开始播放了。",
            "给ui按钮做了过渡动画，没被选中时是灰色。",
            "更多细微调整。"
        ]
    }
];
